Revit 2026 API

# MaterialClearMaterialAspect Method

---

Removes an aspect from the material.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ClearMaterialAspect(
	MaterialAspect aspect
)
```
```vb
Public Sub ClearMaterialAspect (
	aspect As MaterialAspect
)
```
```cpp
public:
void ClearMaterialAspect(
	MaterialAspect aspect
)
```
```fsharp
member ClearMaterialAspect :
        aspect : MaterialAspect -> unit
```

#### Parameters

aspect MaterialAspect
     The material aspect.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

Material Class

Autodesk.Revit.DB Namespace